app/Http/Controllers/AuthController.php

insert into `users` (`firstname`, `lastname`, `email`, `password`, `tel`, `isAdmin`, `updated_at`, `created_at`) values ('Felix', 'Admin', 'felix@mail.com', '$2y$12$MGkNDMkja9M8VXQroj7Kr.NTg3Tp7Ecko97K8fwdGZ.7/DRG9rt36', '0000000000', 1, '2024-01-08 13:14:10', '2024-01-08 13:14:10')
---
    public function createUser(RegisterRequest $req): RedirectResponse {
        $data = $req->validated();

        User::create($data+['isAdmin' => false,]);